# ArrowCentered Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ArrowCentered Property
ParameterTypeId Class See Also
---
"Tick Mark Centered"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ArrowCentered { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArrowCentered As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ArrowCentered {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace